# PathOfTravelCalculationService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..PathOfTravelCalculationService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for path of travel calculations
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId PathOfTravelCalculationService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathOfTravelCalculationService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ PathOfTravelCalculationService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace